app/controllers/authentication_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1  [["email", "aa@fhujjssxsiikkjjhf.com"]]
---
    def authenticate
      auth_token =
        AuthenticateUser.new(auth_params[:email], auth_params[:password]).call

        # @users = User.all
          @user_data = User.where(email: auth_params[:email])