app/controllers/comments_controller.rb

    def create
      @question.comments.create!(comment_params)
---
INSERT INTO "comments" ("created_by", "question_id", "created_at", "updated_at", "content") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_by", "g"], ["question_id", 21], ["created_at", "2020-04-28 01:00:05.759484"], ["updated_at", "2020-04-28 01:00:05.759484"], ["content", "ffufifkfiyfi"]]

    def set_question
      @question = Question.find(params[:question_id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

    def set_question_comment
      @comment = @question.comments.find_by!(id: params[:id]) if @question
---
SELECT "comments".* FROM "comments" WHERE "comments"."question_id" = $1  [["question_id", 2]]