app/controllers/questions_controller.rb

    def create
      @question = current_user.questions.create!(question_params)
---
INSERT INTO "questions" ("title", "created_by", "created_at", "updated_at", "content") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "hi algdihld"], ["created_by", "Khalid"], ["created_at", "2020-05-01 23:17:15.877056"], ["updated_at", "2020-05-01 23:17:15.877056"], ["content", "ukfgh.kghj"]]

    def deletePost
        if current_user.user_type == "admin"
            Question.find(params[:id]).destroy
---
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 28]]
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]