app/controllers/users_controller.rb

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 54]]
---
  def delete
    if current_user.user_type === "admin"
      User.delete(params[:id])