app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at", "user_type", "username") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."email" = $1  [["email", "Azeqwfzajhkmed1997@me.com"]]
---
  def create
    user = User.create!(user_params)
    auth_token = AuthenticateUser.new(user.email, user.password).call
    @user_data = User.where(email: user_params[:email])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
---
  def getUser
    user = User.find(params[:id])
    response = {first_name: user.first_name, last_name: user.last_name, user_type: user.user_type, email: user.email, id: user.id}

SELECT "users".* FROM "users" WHERE "users"."first_name" = $1  [["first_name", " azzam"]]
SELECT "users".* FROM "users"
---
  def index

    if (params[:q])
    users = User.where("first_name LIKE ?", "%" + params[:q] + "%")
      json_response(users)

    else
      json_response(User.all)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
UPDATE "users" SET "user_type" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["user_type", "normal user"], ["updated_at", "2020-04-29 17:23:22.865202"], ["id", 29]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]
---
  def promote
    if current_user.user_type === "admin"
      @user = User.find(params[:id])
      @user.user_type = "admin"
      @user.save

      response = {message: " #{@user.first_name} has been promoted"}

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]
UPDATE "users" SET "user_type" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["user_type", "normal user"], ["updated_at", "2020-05-01 23:16:46.952578"], ["id", 51]]
---
  def demote
    if current_user.user_type === "admin"
      @user = User.find(params[:id])
      @user.user_type = "normal user"
      @user.save

UPDATE "users" SET "first_name" = $1, "last_name" = $2, "email" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["first_name", "Azzam"], ["last_name", "Alkhaldi"], ["email", "b3o"], ["updated_at", "2020-04-30 20:36:26.905946"], ["id", 39]]
---
  def update
    current_user.update(user_params)